{
  "movies": [
    {
      "Title": "Frozen II",
      "Rating": "5",
      "ApiId": "330457",
      "Genre": "Family,Animation,Adventure",
      "Overview": "Elsa, Anna, Kristoff and Olaf head far into the forest to learn the truth about an ancient mystery of their kingdom.",
      "Poster": "/mINJaa34MtknCYl5AjtNJzWj8cD.jpg",
      "Year": "2019-11-20",
      "Runtime": "103",
      "IMDBid": "tt4520988",
      "Trailer": "FRe2toPFn9Q",
      "id": 1,
      "Ratings": "5"
    },
    {
      "Title": "The Wedding Singer",
      "Rating": "5",
      "ApiId": "11003",
      "Genre": "Romance,Comedy",
      "Overview": "Robbie, a local rock star turned wedding singer, is dumped on the day of his wedding. Meanwhile, waitress Julia finally sets a wedding date with her fiancée Glenn. When Julia and Robbie meet and hit it off, they find that things are more complicated than anybody thought.",
      "Poster": "/zVvyTrcZQb7kC2DPDzyo25WcxXp.jpg",
      "Year": "1998-02-13",
      "Runtime": "100",
      "IMDBid": "tt0120888",
      "Trailer": "8yjOXMTa6vA",
      "id": 2
    },
    {
      "Title": "Halloween II",
      "Rating": "4",
      "ApiId": "24150",
      "Genre": "Horror",
      "Overview": "Laurie Strode struggles to come to terms with her brother Michael's deadly return to Haddonfield, Illinois. Meanwhile, Michael prepares for another reunion with his sister.",
      "Poster": "/vSHPM4LQDpWdQrD5KZWK6wNqSOD.jpg",
      "Year": "2009-08-28",
      "Runtime": "105",
      "IMDBid": "tt1311067",
      "Trailer": "KXkcgqmKZ2Y",
      "id": 3
    },
    {
      "Title": "The Amazing Spider-Man",
      "Rating": "3",
      "ApiId": "1930",
      "Genre": "Action,Adventure,Fantasy",
      "Overview": "Peter Parker is an outcast high schooler abandoned by his parents as a boy, leaving him to be raised by his Uncle Ben and Aunt May. Like most teenagers, Peter is trying to figure out who he is and how he got to be the person he is today. As Peter discovers a mysterious briefcase that belonged to his father, he begins a quest to understand his parents' disappearance – leading him directly to Oscorp and the lab of Dr. Curt Connors, his father's former partner. As Spider-Man is set on a collision course with Connors' alter ego, The Lizard, Peter will make life-altering choices to use his powers and shape his destiny to become a hero.",
      "Poster": "/jIfkQNARYyERqRAq1p1c8xgePp4.jpg",
      "Year": "2012-06-23",
      "Runtime": "136",
      "IMDBid": "tt0948470",
      "Trailer": "yUAfRKZO3y0",
      "id": 4,
      "Ratings": "5"
    },
    {
      "Title": "Batman: The Dark Knight Returns, Part 2",
      "Rating": "5",
      "ApiId": "142061",
      "Genre": "Action,Animation",
      "Overview": "Batman has stopped the reign of terror that The Mutants had cast upon his city.  Now an old foe wants a reunion and the government wants The Man of Steel to put a stop to Batman.",
      "Poster": "/arEZYd6uMOFTILne9Ux0A8qctMe.jpg",
      "Year": "2013-01-03",
      "Runtime": "78",
      "IMDBid": "tt2166834",
      "Trailer": "dD2VyqyKvwg",
      "id": 5,
      "Ratings": "3"
    },
    {
      "Title": "Moana",
      "Rating": "5",
      "ApiId": "277834",
      "Genre": "Adventure,Comedy,Family,Animation",
      "Overview": "In Ancient Polynesia, when a terrible curse incurred by Maui reaches an impetuous Chieftain's daughter's island, she answers the Ocean's call to seek out the demigod to set things right.",
      "Poster": "/vNJFiwtsl7Twww7C0uM4qPnygNw.jpg",
      "Year": "2016-10-13",
      "Runtime": "107",
      "IMDBid": "tt3521164",
      "Trailer": "xBnMBU1DhFU",
      "id": 6
    },
    {
      "Title": "Wonder Woman",
      "Rating": "5",
      "ApiId": "297762",
      "Genre": "Action,Adventure,Fantasy",
      "Overview": "An Amazon princess comes to the world of Man in the grips of the First World War to confront the forces of evil and bring an end to human conflict.",
      "Poster": "/imekS7f1OuHyUP2LAiTEM0zBzUz.jpg",
      "Year": "2017-05-30",
      "Runtime": "141",
      "IMDBid": "tt0451279",
      "Trailer": "sFM2QBrtV0Y",
      "id": 7
    },
    {
      "Title": "Teenage Mutant Ninja Turtles: Mutant Mayhem",
      "Rating": "5",
      "ApiId": "614930",
      "Genre": "Animation,Comedy,Action",
      "Overview": "After years of being sheltered from the human world, the Turtle brothers set out to win the hearts of New Yorkers and be accepted as normal teenagers through heroic acts. Their new friend April O'Neil helps them take on a mysterious crime syndicate, but they soon get in over their heads when an army of mutants is unleashed upon them.",
      "Poster": "/ueO9MYIOHO7M1PiMUeX74uf8fB9.jpg",
      "Year": "2023-07-31",
      "Runtime": "100",
      "IMDBid": "tt8589698",
      "Trailer": "7HldRxOEokw",
      "id": 8
    },
    {
      "Title": "Batman v Superman: Dawn of Justice",
      "Rating": "4",
      "ApiId": "209112",
      "Genre": "Action,Adventure",
      "Overview": "Fearing the actions of a god-like Super Hero left unchecked, Gotham City’s own formidable, forceful vigilante takes on Metropolis’s most revered, modern-day savior, while the world wrestles with what sort of hero it really needs. And with Batman and Superman at war with one another, a new threat quickly arises, putting mankind in greater danger than it’s ever known before.",
      "Poster": "/5UsK3grJvtQrtzEgqNlDljJW96w.jpg",
      "Year": "2016-03-23",
      "Runtime": "152",
      "IMDBid": "tt2975590",
      "Trailer": "9boP0bV1y8s",
      "id": 9
    },
    {
      "Title": "The Little Mermaid",
      "Rating": "4",
      "ApiId": "447277",
      "Genre": "Adventure,Family,Fantasy,Romance",
      "Overview": "The youngest of King Triton’s daughters, and the most defiant, Ariel longs to find out more about the world beyond the sea, and while visiting the surface, falls for the dashing Prince Eric. With mermaids forbidden to interact with humans, Ariel makes a deal with the evil sea witch, Ursula, which gives her a chance to experience life on land, but ultimately places her life – and her father’s crown – in jeopardy.",
      "Poster": "/ym1dxyOk4jFcSl4Q2zmRrA5BEEN.jpg",
      "Year": "2023-05-18",
      "Runtime": "135",
      "IMDBid": "tt5971474",
      "Trailer": "P-S_u-mPGIo",
      "id": 10
    },
    {
      "Title": "Coco",
      "Rating": "5",
      "ApiId": "354912",
      "Genre": "Family,Animation,Fantasy,Music,Comedy,Adventure",
      "Overview": "Despite his family’s baffling generations-old ban on music, Miguel dreams of becoming an accomplished musician like his idol, Ernesto de la Cruz. Desperate to prove his talent, Miguel finds himself in the stunning and colorful Land of the Dead following a mysterious chain of events. Along the way, he meets charming trickster Hector, and together, they set off on an extraordinary journey to unlock the real story behind Miguel's family history.",
      "Poster": "/gGEsBPAijhVUFoiNpgZXqRVWJt2.jpg",
      "Year": "2017-10-27",
      "Runtime": "105",
      "IMDBid": "tt2380307",
      "Trailer": "rKCUPdZHyyc",
      "id": 12
    },
    {
      "Title": "The Breakfast Club",
      "Rating": "5",
      "ApiId": "2108",
      "Genre": "Comedy,Drama",
      "Overview": "Five high school students from different walks of life endure a Saturday detention under a power-hungry principal. The disparate group includes rebel John, princess Claire, outcast Allison, brainy Brian and Andrew, the jock. Each has a chance to tell his or her story, making the others see them a little differently -- and when the day ends, they question whether school will ever be the same.",
      "Poster": "/9nai8pRm4Ja0O265Qp6UyqXlLQ8.jpg",
      "Year": "1985-02-15",
      "Runtime": "98",
      "IMDBid": "tt0088847",
      "Trailer": "7xhah55sKJA",
      "id": 15
    },
    {
      "Title": "American Sniper",
      "Rating": "5",
      "ApiId": "190859",
      "Genre": "War,Action",
      "Overview": "U.S. Navy SEAL Chris Kyle takes his sole mission—protect his comrades—to heart and becomes one of the most lethal snipers in American history. His pinpoint accuracy not only saves countless lives but also makes him a prime target of insurgents. Despite grave danger and his struggle to be a good husband and father to his family back in the States, Kyle serves four tours of duty in Iraq. However, when he finally returns home, he finds that he cannot leave the war behind.",
      "Poster": "/i1U46OwMc6vlm7OoSUKfqUH615e.jpg",
      "Year": "2014-12-25",
      "Runtime": "133",
      "IMDBid": "tt2179136",
      "Trailer": "5bP1f_1o-zo",
      "id": 16
    },
    {
      "Title": "Encanto",
      "Rating": "5",
      "ApiId": "568124",
      "Genre": "Animation,Comedy,Family,Fantasy",
      "Overview": "The tale of an extraordinary family, the Madrigals, who live hidden in the mountains of Colombia, in a magical house, in a vibrant town, in a wondrous, charmed place called an Encanto. The magic of the Encanto has blessed every child in the family—every child except one, Mirabel. But when she discovers that the magic surrounding the Encanto is in danger, Mirabel decides that she, the only ordinary Madrigal, might just be her exceptional family's last hope.",
      "Poster": "/4j0PNHkMr5ax3IA8tjtxcmPU3QT.jpg",
      "Year": "2021-10-13",
      "Runtime": "102",
      "IMDBid": "tt2953050",
      "Trailer": "0Rmiq2PPQDg",
      "id": 17
    },
    {
      "Title": "The Wolf of Wall Street",
      "Rating": "5",
      "ApiId": "106646",
      "Genre": "Crime,Drama,Comedy",
      "Overview": "A New York stockbroker refuses to cooperate in a large securities fraud case involving corruption on Wall Street, corporate banking world and mob infiltration. Based on Jordan Belfort's autobiography.",
      "Poster": "/34m2tygAYBGqA9MXKhRDtzYd4MR.jpg",
      "Year": "2013-12-25",
      "Runtime": "180",
      "IMDBid": "tt0993846",
      "Trailer": "g07Xxr20L9s",
      "id": 20
    },
    {
      "Title": "Cats",
      "Rating": "5",
      "ApiId": "513386",
      "Genre": "Animation,Family",
      "Overview": "A cat named Blanket has long been living in a high-rise apartment in the city with his son, Cloak. One day, curious about the outside world, Cloak decides to leave home and embarks on an adventure to find the legendary cat's paradise. To find his son, Blanket must overcome his fear and reconcile with his past, with the help of a female Macaw.",
      "Poster": "/lsZheNTApIa1nrgBWzw90gXdy3Y.jpg",
      "Year": "2018-04-05",
      "Runtime": "105",
      "IMDBid": "tt7886614",
      "Trailer": "41Xw_Q38-Eo",
      "id": 21
    }
  ]
}